ccsudata/hoverboard-firmware-hack-FOC/hovercar-gd32/usart.c
    USART_SendString(buffer);
}

// ============================================
// 内部函数
// ============================================

/**
 * @brief 处理接收到的字符
 * @param ch 接收到的字符
 */
static void process_received_char(uint8_t ch) {
    // 只在中断内接收并缓存数据，避免阻塞和被动丢包
    if (ch == '\r' || ch == '\n') {
        if (rx_index > 0 && rx_ready == RESET) {
            rx_buffer[rx_index] = '\0';  // 添加字符串结束符
            rx_ready = SET;
            rx_timestamp = GetSystemTicks();
        }
    } else if (ch == 0x08 || ch == 0x7F) {  // 退格或删除
        if (rx_index > 0) {
            rx_index--;
        }
    } else if (rx_index < sizeof(rx_buffer) - 1 && rx_ready == RESET) {
        rx_buffer[rx_index++] = ch;
    }
}

// 命令帮助函数
static int16_t parse_pwm_value(const char* str) {
    int16_t value = atoi(str);
    return CLAMP(value, -1000, 1000);
}





// 解析形如 "PA3" 的引脚描述，返回 1=成功，0=失败
static int parse_pin_string(const char* s, uint32_t* out_port, uint16_t* out_pin) {
    if (!s) return 0;
    // Accept formats: PA3, pa3, A3, a3
    const char* p = s;
    // skip leading spaces
    while (*p == ' ') p++;

    char portch = 0;
    const char* numptr = NULL;
    if ((p[0] == 'P' || p[0] == 'p') && (p[1] >= 'A' && p[1] <= 'z')) {
        portch = p[1];
        numptr = p + 2;
    } else if ((p[0] >= 'A' && p[0] <= 'z')) {
        portch = p[0];
        numptr = p + 1;
    } else {
        return 0;
    }

    if (portch >= 'a' && portch <= 'z') portch -= ('a' - 'A');
    if (portch < 'A' || portch > 'G') return 0;

    int pin = atoi(numptr);
    if (pin < 0 || pin > 15) return 0;

    switch (portch) {
        case 'A': *out_port = (uint32_t)GPIOA; rcu_periph_clock_enable(RCU_GPIOA); break;
        case 'B': *out_port = (uint32_t)GPIOB; rcu_periph_clock_enable(RCU_GPIOB); break;
        case 'C': *out_port = (uint32_t)GPIOC; rcu_periph_clock_enable(RCU_GPIOC); break;
        case 'D': *out_port = (uint32_t)GPIOD; rcu_periph_clock_enable(RCU_GPIOD); break;
        case 'E': *out_port = (uint32_t)GPIOE; rcu_periph_clock_enable(RCU_GPIOE); break;
        default: return 0;
    }

    *out_pin = (uint16_t)(1U << pin);
    return 1;
}

// 读取任意引脚值（原始GPIO读数）并输出
static void cmd_gpio_read(const char* arg) {
    uint32_t port; uint16_t pin;
    if (!parse_pin_string(arg, &port, &pin)) {
        USART_SendString("gpio read usage: gpio read PA3\r\n");
        return;
    }
    uint8_t raw = GPIO_INPUT_BIT_GET((uint32_t)port, pin);
    USART_Printf("GPIO %s: raw=%d (pin mask 0x%04X)\r\n", arg, raw, pin);
}

// 将任意引脚设为输出并写入 0/1
static void cmd_gpio_write(const char* arg, const char* valstr) {
    uint32_t port; uint16_t pin;
    if (!parse_pin_string(arg, &port, &pin)) {
        USART_SendString("gpio write usage: gpio write PA3 1\r\n");
        return;
    }
    int v = atoi(valstr);
    // 配置为推挽输出
    gpio_init((uint32_t)port, GPIO_MODE_OUT_PP, GPIO_OSPEED_50MHZ, pin);
    if (v) gpio_bit_set((uint32_t)port, pin); else gpio_bit_reset((uint32_t)port, pin);
    USART_Printf("GPIO %s set to %d\r\n", arg, v ? 1 : 0);
}

static int calculate_pwm_timer_params(int hz, uint32_t* prescaler_out, uint32_t* period_out) {
    if (hz <= 0 || prescaler_out == NULL || period_out == NULL) {
        return 0;
    }

    uint32_t timer_clock = SYSTEM_CORE_CLOCK;
    uint32_t total_ticks = timer_clock / (uint32_t)hz;
    if (total_ticks == 0) {
        return 0;
    }

    uint32_t prescaler = (total_ticks - 1U) / 0x10000U;
    if (prescaler > 0xFFFFU) {
        return 0;
    }

    uint32_t period = total_ticks / (prescaler + 1U);
    if (period == 0 || period > 0xFFFFU) {
        return 0;
    }

    *prescaler_out = prescaler;
    *period_out = period;
    return 1;
}

// 设置所有可用 PWM 定时器频率和占空比（默认 50%）
static void cmd_pwm_all(const char* hzstr, const char* dutystr) {
    int hz = atoi(hzstr);
    int duty = dutystr ? atoi(dutystr) : 50;
    if (hz <= 0 || duty < 0 || duty > 100) {
        USART_SendString("pwm all usage: pwm all <hz> [duty_percent]\r\n");
        return;
    }

    uint32_t prescaler;
    uint32_t period;
    if (!calculate_pwm_timer_params(hz, &prescaler, &period)) {
        USART_Printf("Requested frequency out of range: %d Hz\r\n", hz);
        return;
    }

    uint32_t pulse = (((uint32_t)period + 1U) * (uint32_t)duty) / 100U;
    if (pulse > period) {
        pulse = period;
    }

    // Ensure timer and GPIO/AF clocks enabled and reset TIM1 as user script
    rcu_periph_reset_enable(RCU_TIMER1RST);
    rcu_periph_reset_disable(RCU_TIMER1RST);
    rcu_periph_clock_enable(RCU_TIMER1);
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_AF);
    // Ensure TIM1 uses default AF mapping for its channels
    volatile uint32_t* AFIO_MAPR = (uint32_t*)0x40010004;
    *AFIO_MAPR &= ~(3 << 8);

    timer_parameter_struct timer_init_struct;
    timer_oc_parameter_struct oc_init_struct;

    // 通用定时器初始化结构
    timer_deinit(TIMER1);
    timer_init_struct.prescaler = (uint16_t)prescaler;
    timer_init_struct.alignedmode = TIMER_COUNTER_CENTER_BOTH;
    timer_init_struct.counterdirection = TIMER_COUNTER_UP;
    timer_init_struct.period = (uint16_t)period;
    timer_init_struct.clockdivision = TIMER_CKDIV_DIV1;
    timer_init_struct.repetitioncounter = 0;
    timer_init(TIMER1, &timer_init_struct);

    oc_init_struct.outputstate = TIMER_CCX_ENABLE;
    oc_init_struct.outputnstate = TIMER_CCXN_ENABLE;
    oc_init_struct.ocpolarity = TIMER_OC_POLARITY_HIGH;
    oc_init_struct.ocnpolarity = TIMER_OCN_POLARITY_LOW;
    oc_init_struct.ocidlestate = TIMER_OC_IDLE_STATE_LOW;
    oc_init_struct.ocnidlestate = TIMER_OCN_IDLE_STATE_HIGH;

    timer_channel_output_config(TIMER1, TIMER_CH_1, &oc_init_struct);
    timer_channel_output_config(TIMER1, TIMER_CH_2, &oc_init_struct);
    timer_channel_output_config(TIMER1, TIMER_CH_3, &oc_init_struct);

