ccsudata/hoverboard-firmware-hack-FOC/hovercar-gd32/usart.c
    timer_channel_output_mode_config(TIMER1, TIMER_CH_1, TIMER_OC_MODE_PWM1);
    timer_channel_output_mode_config(TIMER1, TIMER_CH_2, TIMER_OC_MODE_PWM1);
    timer_channel_output_mode_config(TIMER1, TIMER_CH_3, TIMER_OC_MODE_PWM1);

    timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_1, (uint16_t)pulse);
    timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_2, (uint16_t)pulse);
    timer_channel_output_pulse_value_config(TIMER1, TIMER_CH_3, (uint16_t)pulse);
    timer_enable(TIMER1);

    // TIM3 CH3
    timer_deinit(TIMER3);
    timer_init_struct.period = (uint16_t)period;
    timer_init(TIMER3, &timer_init_struct);
    timer_channel_output_config(TIMER3, TIMER_CH_3, &oc_init_struct);
    timer_channel_output_mode_config(TIMER3, TIMER_CH_3, TIMER_OC_MODE_PWM1);
    timer_channel_output_pulse_value_config(TIMER3, TIMER_CH_3, (uint16_t)pulse);
    timer_enable(TIMER3);

    // TIM4 CH1, CH3
    timer_deinit(TIMER4);
    timer_init_struct.period = (uint16_t)period;
    timer_init(TIMER4, &timer_init_struct);
    timer_channel_output_config(TIMER4, TIMER_CH_1, &oc_init_struct);
    timer_channel_output_config(TIMER4, TIMER_CH_3, &oc_init_struct);
    timer_channel_output_mode_config(TIMER4, TIMER_CH_1, TIMER_OC_MODE_PWM1);
    timer_channel_output_mode_config(TIMER4, TIMER_CH_3, TIMER_OC_MODE_PWM1);
    timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_1, (uint16_t)pulse);
    timer_channel_output_pulse_value_config(TIMER4, TIMER_CH_3, (uint16_t)pulse);
    timer_enable(TIMER4);

    USART_Printf("PWM set: %d Hz, duty %d%% (psc=%lu, period=%lu, pulse=%lu)\r\n", hz, duty, prescaler, period, pulse);
}

// 为单个引脚配置 PWM（目前实现 PA3 -> TIM1_CH3）
static void cmd_pwm_pin(const char* pinstr, int hz, int duty) {
    // 1. 解析引脚（保持你的逻辑）
    uint32_t port; uint16_t pin;
    if (!parse_pin_string(pinstr, &port, &pin)) {
        USART_Printf("Unsupported pin: %s\r\n", pinstr);
        return;
    }

    // 严格校验是否为 PA3
    if ((uint32_t)GPIOA != port || pin != GPIO_PIN_3) {
        USART_Printf("pwm pin: only PA3 currently supported\r\n");
        return;
    }

    // 2. 计算定时器参数
    uint32_t prescaler;
    uint32_t period;
    if (!calculate_pwm_timer_params(hz, &prescaler, &period)) {
        USART_Printf("Requested frequency out of range: %d Hz\r\n", hz);
        return;
    }
    uint32_t pulse = (((uint32_t)period + 1U) * (uint32_t)duty) / 100U;

    // 3. 严格按照 GDB 成功的逻辑配置
    // 复位 TIMER1
    rcu_periph_reset_enable(RCU_TIMER1RST);
    rcu_periph_reset_disable(RCU_TIMER1RST);
    
    // 开启时钟
    rcu_periph_clock_enable(RCU_TIMER1);
    rcu_periph_clock_enable(RCU_GPIOA);
    rcu_periph_clock_enable(RCU_AF);
    
    // 清除 AFIO_MAPR 的 Bit 9:8 (TIMER1 重映射控制位)
    volatile uint32_t* AFIO_MAPR = (uint32_t*)0x40010004;
    *AFIO_MAPR &= ~(3 << 8);

    // 4. 配置 PA3 为复用推挽输出 (AF_PP)
    gpio_init(GPIOA, GPIO_MODE_AF_PP, GPIO_OSPEED_50MHZ, GPIO_PIN_3);

    // 5. 直接寄存器配置，严格匹配 GDB 脚本
    volatile uint32_t* TIMER1_CTL0   = (uint32_t*)(TIMER1 + 0x00);
    volatile uint32_t* TIMER1_SWEVG  = (uint32_t*)(TIMER1 + 0x14);
    volatile uint32_t* TIMER1_CHCTL2 = (uint32_t*)(TIMER1 + 0x20);
    volatile uint32_t* TIMER1_CHCTL1 = (uint32_t*)(TIMER1 + 0x1C);
    volatile uint32_t* TIMER1_CNT    = (uint32_t*)(TIMER1 + 0x24);
    volatile uint32_t* TIMER1_PSC    = (uint32_t*)(TIMER1 + 0x28);
    volatile uint32_t* TIMER1_CAR    = (uint32_t*)(TIMER1 + 0x2C);
    volatile uint32_t* TIMER1_CH3CV  = (uint32_t*)(TIMER1 + 0x40);
    
    // 设置计数器、预分频器、自动重载值
    *TIMER1_CNT   = 0;
    *TIMER1_PSC   = (uint32_t)prescaler;
    *TIMER1_CAR   = (uint32_t)period;
    *TIMER1_CH3CV = (uint32_t)pulse;
    
    // 配置通道3为PWM模式1
    *TIMER1_CHCTL1 = (*TIMER1_CHCTL1 & ~0xFF) | 0x68;  // CH3配置为PWM模式1
    
    // 使能通道3输出
    *TIMER1_CHCTL2 &= ~(1 << 13);  // 清除CH3N输出使能
    *TIMER1_CHCTL2 |= (1 << 12);   // 设置CH3输出使能
    
    // 生成软件更新事件
    *TIMER1_SWEVG = (1 << 0);
    
    // 使能定时器
    *TIMER1_CTL0 |= (1 << 0);

    USART_Printf("PA3 (TIMER1_CH3) PWM active: %d Hz, duty %d%% (psc=%lu, period=%lu, pulse=%lu)\r\n", 
                 hz, duty, prescaler, period, pulse);
}


/**
 * @brief 处理命令
 * @param command 命令字符串
 */
static void process_command(const char* command) {
    if (command == NULL || strlen(command) == 0) {
        return;
    }
    
    char cmd_copy[256];
    strncpy(cmd_copy, command, sizeof(cmd_copy) - 1);
    cmd_copy[sizeof(cmd_copy) - 1] = '\0';
    
    // 转换为小写以便比较
    for (int i = 0; cmd_copy[i]; i++) {
        if (cmd_copy[i] >= 'A' && cmd_copy[i] <= 'Z') {
            cmd_copy[i] += 32;
        }
    }
    
    // 命令处理
    if (strcmp(cmd_copy, "help") == 0 || strcmp(cmd_copy, "?") == 0) {
        USART_SendString("\r\n=== HOVERCAR SERIAL COMMANDS ===\r\n");
        USART_SendString("Motor Control:\r\n");
        USART_SendString("  motor enable              - Enable motors\r\n");
        USART_SendString("  motor disable             - Disable motors\r\n");
        USART_SendString("  motor left <pwm>          - Set left motor PWM (-1000~1000)\r\n");
        USART_SendString("  motor right <pwm>         - Set right motor PWM (-1000~1000)\r\n");
        USART_SendString("  motor both <pwm>          - Set both motors PWM (-1000~1000)\r\n");
        USART_SendString("  mo [pwm]                  - Open-loop left motor PWM, default left\r\n");
        USART_SendString("  mo left <pwm>             - Open-loop left motor PWM\r\n");
        USART_SendString("  mo right <pwm>            - Open-loop right motor PWM\r\n");
        USART_SendString("\r\nSystem Status:\r\n");
        USART_SendString("  status                    - Show system status\r\n");
        USART_SendString("  adc                       - Show ADC values\r\n");
        USART_SendString("  battery                   - Show battery voltage\r\n");
        USART_SendString("  current                   - Show motor current\r\n");
        USART_SendString("  speed                     - Show motor speeds\r\n");
        USART_SendString("  hall                      - Show hall sensor states\r\n");
        USART_SendString("\r\nBuzzer Control:\r\n");
        USART_SendString("  beep <n>                  - Beep n times (1-10)\r\n");
        USART_SendString("  buzzer <pattern>          - Play buzzer pattern\r\n");
        USART_SendString("\r\nSystem:\r\n");
        USART_SendString("  reset                     - Reset system\r\n");
        USART_SendString("  help/?                    - Show this help\r\n");
        USART_SendString("================================\r\n");
    }
    
