ccsudata/hoverboard-firmware-hack-FOC/hovercar-gd32/usart.c
    else if (strncmp(cmd_copy, "motor ", 6) == 0) {
        const char* motor_cmd = command + 6;
        
        if (strncmp(motor_cmd, "enable", 6) == 0) {
            SetMotorsEnable(SET);
            vehicle.enable = SET;
            USART_SendString("Motors enabled\r\n");
        }
        else if (strncmp(motor_cmd, "disable", 7) == 0) {
            SetMotorsEnable(RESET);
            vehicle.enable = RESET;
            USART_SendString("Motors disabled\r\n");
        }
        else if (strncmp(motor_cmd, "left ", 5) == 0) {
            int16_t pwm = parse_pwm_value(motor_cmd + 5);
            SetLeftMotorPWM(pwm);
            USART_Printf("Left motor PWM: %d\r\n", pwm);
        }
        else if (strncmp(motor_cmd, "right ", 6) == 0) {
            int16_t pwm = parse_pwm_value(motor_cmd + 6);
            SetRightMotorPWM(pwm);
            USART_Printf("Right motor PWM: %d\r\n", pwm);
        }
        else if (strncmp(motor_cmd, "both ", 5) == 0) {
            int16_t pwm = parse_pwm_value(motor_cmd + 5);
            SetLeftMotorPWM(pwm);
            SetRightMotorPWM(pwm);
            USART_Printf("Both motors PWM: %d\r\n", pwm);
        }
        else {
            USART_SendString("Motor command: enable|disable|left|right|both\r\n");
        }
    }

        else if (strncmp(cmd_copy, "gpio ", 5) == 0) {
            const char* args = command + 5;
            while (*args == ' ') args++;
            if (strncasecmp(args, "read ", 5) == 0) {
                const char* pinstr = args + 5;
                while (*pinstr == ' ') pinstr++;
                cmd_gpio_read(pinstr);
            } else if (strncasecmp(args, "write ", 6) == 0) {
                const char* rest = args + 6;
                while (*rest == ' ') rest++;
                // split pin and value
                char pinbuf[16]; int i=0;
                while (*rest && *rest != ' ' && i < (int)sizeof(pinbuf)-1) pinbuf[i++] = *rest++;
                pinbuf[i] = '\0';
                while (*rest == ' ') rest++;
                cmd_gpio_write(pinbuf, rest);
            } else {
                USART_SendString("gpio commands:\r\n  gpio read PA3\r\n  gpio write PA3 1\r\n");
            }
        }
        else if (cmd_copy[0] == 'r' && cmd_copy[1] == ' ') {
            const char* arg = command + 2;
            while (*arg == ' ') arg++;
            char pinbuf[16]; int i=0;
            while (*arg && *arg != ' ' && i < (int)sizeof(pinbuf)-1) pinbuf[i++] = *arg++;
            pinbuf[i] = '\0';
            if (i == 0) {
                USART_SendString("r usage: r PA3 or r A3\r\n");
            } else {
                cmd_gpio_read(pinbuf);
            }
        }
        else if (cmd_copy[0] == 'w' && cmd_copy[1] == ' ') {
            const char* rest = command + 2;
            while (*rest == ' ') rest++;
            char pinbuf[16]; int i=0;
            while (*rest && *rest != ' ' && i < (int)sizeof(pinbuf)-1) pinbuf[i++] = *rest++;
            pinbuf[i] = '\0';
            while (*rest == ' ') rest++;
            if (i == 0 || *rest == 0) {
                USART_SendString("w usage: w PA3 1\r\n");
            } else {
                cmd_gpio_write(pinbuf, rest);
            }
        }
    
    else if (strcmp(cmd_copy, "status") == 0) {
        USART_SendString("\r\n=== SYSTEM STATUS ===\r\n");
        USART_Printf("State: %d (0=Init,1=Ready,2=Running,3=Error)\r\n", system_state);
        USART_Printf("Battery: %.2fV\r\n", vehicle.battery_voltage);
        USART_Printf("Current: %.2fA\r\n", GetTotalCurrent());
        USART_Printf("Left Speed: %.0f RPM, Hall: %d\r\n", GetLeftMotorSpeed(), left_motor.hall_state);
        USART_Printf("Right Speed: %.0f RPM, Hall: %d\r\n", GetRightMotorSpeed(), right_motor.hall_state);
        USART_Printf("Throttle: %d, Steering: %d\r\n", vehicle.throttle, vehicle.steering);
        USART_Printf("Motors Enabled: %s\r\n", vehicle.enable ? "YES" : "NO");
        USART_SendString("====================\r\n");
    }
    
    else if (strcmp(cmd_copy, "adc") == 0) {
        USART_SendString("\r\n=== ADC VALUES ===\r\n");
        USART_Printf("Battery ADC: %d (counts)\r\n", adc_buffer.battery);
        USART_Printf("Current ADC: %d (counts)\r\n", adc_buffer.current);
        USART_Printf("Temp ADC: %d (counts)\r\n", adc_buffer.temp);
        USART_SendString("==================\r\n");
    }
    
    else if (strcmp(cmd_copy, "battery") == 0) {
        USART_Printf("Battery Voltage: %.2fV\r\n", vehicle.battery_voltage);
        if (vehicle.battery_voltage < BATTERY_DEAD_VOLTAGE) {
            USART_SendString("WARNING: Battery critically low!\r\n");
        } else if (vehicle.battery_voltage < BATTERY_LOW_VOLTAGE) {
            USART_SendString("WARNING: Battery low!\r\n");
        } else {
            USART_SendString("Battery status: Normal\r\n");
        }
    }
    
    else if (strcmp(cmd_copy, "current") == 0) {
        float current = GetTotalCurrent();
        USART_Printf("Motor Current: %.2fA\r\n", current);
        if (current > CURRENT_LIMIT) {
            USART_SendString("WARNING: Current exceeds limit!\r\n");
        }
    }
    
    else if (strcmp(cmd_copy, "speed") == 0) {
        USART_Printf("Left Motor Speed: %.0f RPM\r\n", GetLeftMotorSpeed());
        USART_Printf("Right Motor Speed: %.0f RPM\r\n", GetRightMotorSpeed());
    }
    
    else if (strncmp(cmd_copy, "mo", 2) == 0 && (cmd_copy[2] == ' ' || cmd_copy[2] == '\0')) {
        const char* args = command + 2;
        while (*args == ' ') args++;

        char token[16] = {0};
        int i = 0;
        const char* p = args;
        while (*p && *p != ' ' && i < (int)sizeof(token) - 1) {
            token[i++] = *p++;
        }
        token[i] = '\0';

        const char* motor = "left";
        const char* pwmstr = NULL;
        if (token[0] == '\0') {
            USART_SendString("mo usage: mo [left|right] <pwm>\r\n");
            return;
        }

