ccsudata/hoverboard-firmware-hack-FOC/hovercar-gd32/usart.c
        if ((token[0] == '+' || token[0] == '-' || (token[0] >= '0' && token[0] <= '9')) && token[0] != '\0') {
            pwmstr = token;
        } else {
            if (strncasecmp(token, "left", 4) == 0 || token[0] == 'l' || token[0] == 'L') {
                motor = "left";
            } else if (strncasecmp(token, "right", 5) == 0 || token[0] == 'r' || token[0] == 'R') {
                motor = "right";
            } else {
                USART_SendString("mo usage: mo [left|right] <pwm>\r\n");
                return;
            }
            while (*p == ' ') p++;
            if (*p == '\0') {
                USART_SendString("mo usage: mo [left|right] <pwm>\r\n");
                return;
            }
            pwmstr = p;
        }

        int16_t pwm = parse_pwm_value(pwmstr);
        motor_pwm_openloop(motor, pwm);
        USART_Printf("Open-loop motor %s pwm: %d\r\n", motor, pwm);
    }
    else if (strncmp(cmd_copy, "pwm ", 4) == 0) {
        const char* args = command + 4;
        while (*args == ' ') args++;
        // args may be: all <hz> [duty]  OR  <pin> [hz] [duty]
        if (strncasecmp(args, "all ", 4) == 0) {
            const char* params = args + 4;
            while (*params == ' ') params++;
            // parse hz and optional duty
            char hzbuf[16] = {0}; int i=0;
            while (*params && *params != ' ' && i < (int)sizeof(hzbuf)-1) hzbuf[i++] = *params++;
            hzbuf[i] = '\0';
            while (*params == ' ') params++;
            const char* dutystr = NULL;
            if (*params) dutystr = params;
            cmd_pwm_all(hzbuf, dutystr);
        } else {
            // treat first token as pin
            char pinbuf[16] = {0}; int i=0;
            const char* p = args;
            while (*p && *p != ' ' && i < (int)sizeof(pinbuf)-1) pinbuf[i++] = *p++;
            pinbuf[i] = '\0';
            while (*p == ' ') p++;
            int hz = 1;
            int duty = 50;
            if (*p) {
                char hzbuf[32] = {0}; int j = 0;
                while (*p && *p != ' ' && j < (int)sizeof(hzbuf) - 1) hzbuf[j++] = *p++;
                hzbuf[j] = '\0';
                if (hzbuf[0]) {
                    hz = atoi(hzbuf);
                }
                while (*p == ' ') p++;
                if (*p) {
                    duty = atoi(p);
                }
            }
            if (pinbuf[0]) cmd_pwm_pin(pinbuf, hz, duty);
            else USART_SendString("pwm commands:\r\n  pwm all <hz> [duty_percent]\r\n  pwm PA3 [hz] [duty_percent]\r\n");
        }
    }
    
    else if (strcmp(cmd_copy, "hall") == 0) {
        // 使用 bldc.c 中的 read_hall_sensors 函数读取霍尔传感器
        // 注意：read_hall_sensors 返回的是低电平有效的编码（0=高电平，1=低电平）
        uint8_t left_hall_raw = read_hall_sensors(
            LEFT_HALL_U_PORT, LEFT_HALL_U_PIN,
            LEFT_HALL_V_PORT, LEFT_HALL_V_PIN,
            LEFT_HALL_W_PORT, LEFT_HALL_W_PIN
        );
        
        uint8_t right_hall_raw = read_hall_sensors(
            RIGHT_HALL_U_PORT, RIGHT_HALL_U_PIN,
            RIGHT_HALL_V_PORT, RIGHT_HALL_V_PIN,
            RIGHT_HALL_W_PORT, RIGHT_HALL_W_PIN
        );
        
        // 转换为高电平有效的表示（1=高电平，0=低电平）用于显示
        uint8_t left_u = (left_hall_raw & 0x01) ? 0 : 1;
        uint8_t left_v = (left_hall_raw & 0x02) ? 0 : 1;
        uint8_t left_w = (left_hall_raw & 0x04) ? 0 : 1;
        uint8_t left_high_active = (left_u << 0) | (left_v << 1) | (left_w << 2);
        
        uint8_t right_u = (right_hall_raw & 0x01) ? 0 : 1;
        uint8_t right_v = (right_hall_raw & 0x02) ? 0 : 1;
        uint8_t right_w = (right_hall_raw & 0x04) ? 0 : 1;
        uint8_t right_high_active = (right_u << 0) | (right_v << 1) | (right_w << 2);
        
        USART_SendString("\r\n=== HALL SENSOR STATES ===\r\n");
        USART_SendString("Left Hall pins (低电平有效):\r\n");
        USART_Printf("  LEFT_HALL_U (PB5): raw=0x%02X, high_active=%u\r\n", 
                     (left_hall_raw & 0x01), left_u);
        USART_Printf("  LEFT_HALL_V (PB6): raw=0x%02X, high_active=%u\r\n", 
                     ((left_hall_raw >> 1) & 0x01), left_v);
        USART_Printf("  LEFT_HALL_W (PB7): raw=0x%02X, high_active=%u\r\n", 
                     ((left_hall_raw >> 2) & 0x01), left_w);
        USART_Printf("Left Raw State (低电平有效): 0x%02X (%d)\r\n", left_hall_raw, left_hall_raw);
        USART_Printf("Left High Active State: 0x%02X (%d)\r\n", left_high_active, left_high_active);
        
        // 霍尔状态解释
        USART_SendString("Left Hall Interpretation:\r\n");
        if (left_high_active == 0x00 || left_high_active == 0x07) {
            USART_SendString("  WARNING: Hardware fault (000/111) - Hall disconnected, shorted, or wiring error\r\n");
        } 
        USART_Printf("Left Motor Position: %d\r\n", left_motor.position);
        
        USART_SendString("\r\nRight Hall pins (低电平有效):\r\n");
        USART_Printf("  RIGHT_HALL_U (PC10): raw=0x%02X, high_active=%u\r\n", 
                     (right_hall_raw & 0x01), right_u);
        USART_Printf("  RIGHT_HALL_V (PC11): raw=0x%02X, high_active=%u\r\n", 
                     ((right_hall_raw >> 1) & 0x01), right_v);
        USART_Printf("  RIGHT_HALL_W (PC12): raw=0x%02X, high_active=%u\r\n", 
                     ((right_hall_raw >> 2) & 0x01), right_w);
        USART_Printf("Right Raw State (低电平有效): 0x%02X (%d)\r\n", right_hall_raw, right_hall_raw);
        USART_Printf("Right High Active State: 0x%02X (%d)\r\n", right_high_active, right_high_active);
        
        // 霍尔状态解释
        USART_SendString("Right Hall Interpretation:\r\n");
        if (right_high_active == 0x00 || right_high_active == 0x07) {
            USART_SendString("  WARNING: Hardware fault (000/111) - Hall disconnected, shorted, or wiring error\r\n");
        } 
        
        USART_Printf("Right Motor Position: %d\r\n", right_motor.position);
        
        // 显示全局变量状态用于比较
        USART_SendString("\r\n=== GLOBAL VARIABLE STATES (from bldc.c) ===\r\n");
        USART_Printf("left_motor.hall_state: 0x%02X\r\n", left_motor.hall_state);
        USART_Printf("right_motor.hall_state: 0x%02X\r\n", right_motor.hall_state);
    }
    
    else if (strncmp(cmd_copy, "beep", 4) == 0) {
        const char* param = command + 4;
        while (*param == ' ') param++;
        int beeps = atoi(param);
        if (beeps > 0 && beeps <= 10) {
            for (int i = 0; i < beeps; i++) {
                beep_pattern(1);
                Delay(100);
            }
            USART_Printf("Beep x%d\r\n", beeps);
        } else {
            USART_SendString("Beep count: 1-10\r\n");
        }
    }
    
    else if (strncmp(cmd_copy, "buzzer", 6) == 0) {
        const char* param = command + 6;
        while (*param == ' ') param++;
        int pattern = atoi(param);
        if (pattern > 0 && pattern <= 10) {
            beep_pattern(pattern);
            USART_Printf("Buzzer pattern: %d\r\n", pattern);
        } else {
            USART_SendString("Buzzer pattern: 1-10\r\n");
        }
    }
    
    else if (strcmp(cmd_copy, "reset") == 0) {
        USART_SendString("System reset in 1 second...\r\n");
        Delay(1000);
        NVIC_SystemReset();
    }
    
    else {
        USART_Printf("Unknown command: '%s'\r\n", command);
        USART_SendString("Type 'help' for available commands\r\n");
    }
}

