ccsudata/hoverboard-firmware-hack-FOC/hovercar-gd32/usart.c
// ============================================
// 中断处理函数
// ============================================

/**
 * @brief USART2 中断处理 (调试串口)
 */
void USART2_IRQHandler(void) {
    // 先抢救正常数据，避免 ORERR 处理先读走可用字符。
    if (usart_interrupt_flag_get(DEBUG_USART, USART_INT_FLAG_RBNE) != RESET) {
        uint8_t ch = usart_data_receive(DEBUG_USART);
        process_received_char(ch);
        usart_interrupt_flag_clear(DEBUG_USART, USART_INT_FLAG_RBNE);
    }

    if (usart_flag_get(DEBUG_USART, USART_FLAG_ORERR) != RESET) {
        usart_flag_clear(DEBUG_USART, USART_FLAG_ORERR);
    }

    if (usart_interrupt_flag_get(DEBUG_USART, USART_INT_FLAG_TBE) != RESET) {
        if (tx_count > 0) {
            usart_data_transmit(DEBUG_USART, tx_buffer[tx_tail]);
            tx_tail++;
            if (tx_tail >= USART_TX_BUFFER_SIZE) {
                tx_tail = 0;
            }
            tx_count--;
        }
        if (tx_count == 0) {
            usart_interrupt_disable(DEBUG_USART, USART_INT_TBE);
        }
    }
    
    if (usart_interrupt_flag_get(DEBUG_USART, USART_INT_FLAG_TC) != RESET) {
        usart_interrupt_flag_clear(DEBUG_USART, USART_INT_FLAG_TC);
    }
}

// ============================================
// 重定向printf到串口
// ============================================

#ifdef __GNUC__
// 对于GCC编译器
int _write(int file, char *ptr, int len) {
    (void)file;
    USART_SendData((uint8_t*)ptr, len);
    return len;
}
#else
// 对于其他编译器
int fputc(int ch, FILE *f) {
    (void)f;
    usart_data_transmit(DEBUG_USART, (uint8_t)ch);
    while (usart_flag_get(DEBUG_USART, USART_FLAG_TBE) == RESET);
    return ch;
}
#endif